---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MepSpotCenterlineElevation
source: html/df6fcf00-5df6-7f83-1238-9e91bea0599c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MepSpotCenterlineElevation Property

"Spot Centerline Elevation": used for both design and fabrication components

## Syntax (C#)
```csharp
public static ForgeTypeId MepSpotCenterlineElevation { get; }
```